[
    {
        "bookId": 1,
        "bookName": "The Da Vinci Code",
        "author": "Dan Brown",
        "image": "davinci_code.jpg",
        "review": "In 'The Da Vinci Code' by Dan Brown, readers are taken on a thrilling journey filled with mystery, intrigue, and secrets hidden within the depths of history and art. The story begins with the murder of a curator at the Louvre Museum in Paris, setting off a chain of events that lead symbologist Robert Langdon and cryptologist Sophie Neveu on a quest to unravel the truth behind a centuries-old conspiracy. As they follow a trail of cryptic clues and ancient symbols, they uncover shocking revelations that challenge long-held beliefs about religion, history, and the true nature of humanity.",
        "totalPages": 454,
        "rating": 4.2,
        "category": "Mystery",
        "tags": [
            "Thriller",
            "Conspiracy"
        ],
        "publisher": "Doubleday",
        "yearOfPublishing": 2003
    },
    {
        "bookId": 2,
        "bookName": "Harry Potter and the Philosopher's Stone",
        "author": "J.K. Rowling",
        "image": "harry_potter.jpg",
        "review": "Harry Potter and the Philosopher's Stone by J.K. Rowling is a captivating tale that transports readers into a world of magic, wonder, and adventure. The story follows the young orphan Harry Potter as he discovers his true identity as a wizard and embarks on a journey to Hogwarts School of Witchcraft and Wizardry. Alongside his newfound friends Ron Weasley and Hermione Granger, Harry navigates the challenges of learning magic, uncovering the mysteries of his past, and confronting the dark forces that threaten the wizarding world",
        "totalPages": 320,
        "rating": 4.7,
        "category": "Fantasy",
        "tags": [
            "Wizardry",
            "Adventure"
        ],
        "publisher": "Bloomsbury",
        "yearOfPublishing": 1997
    },
    {
        "bookId": 3,
        "bookName": "The Hitchhiker's Guide to the Galaxy",
        "author": "Douglas Adams",
        "image": "hitchhikers_guide.jpg",
        "review": "The Hitchhiker's Guide to the Galaxy by Douglas Adams is a whimsical and satirical science fiction masterpiece that takes readers on a wild and hilarious journey through space and time. At its heart, the novel follows the misadventures of Arthur Dent, an ordinary human who finds himself thrust into an extraordinary intergalactic adventure after the Earth is unexpectedly destroyed to make way for an interstellar bypass.",
        "totalPages": 224,
        "rating": 4.5,
        "category": "Science Fiction",
        "tags": [
            "Humor",
            "Space Opera"
        ],
        "publisher": "Pan Books",
        "yearOfPublishing": 1979
    },
    {
        "bookId": 4,
        "bookName": "The Lord of the Rings",
        "author": "J.R.R. Tolkien",
        "image": "lord_of_the_rings.jpg",
        "review": "The Lord of the Rings by J.R.R. Tolkien is an epic fantasy saga that has captured the imaginations of readers for generations. Set in the fictional world of Middle-earth, the story follows the perilous quest of a young hobbit named Frodo Baggins as he embarks on a journey to destroy the One Ring, a powerful artifact that threatens to plunge the world into darkness.",
        "totalPages": 1178,
        "rating": 4.8,
        "category": "Fantasy",
        "tags": [
            "Adventure",
            "High Fantasy"
        ],
        "publisher": "Allen & Unwin",
        "yearOfPublishing": 1954
    },
    {
        "bookId": 5,
        "bookName": "The Catcher in the Rye",
        "author": "J.D. Salinger",
        "image": "catcher_in_the_rye.jpg",
        "review": "The Catcher in the Rye by J.D. Salinger is a timeless coming-of-age novel that has resonated with readers since its publication in 1951. The story follows the introspective and disillusioned teenager Holden Caulfield as he navigates the challenges of adolescence in post-World War II America. After being expelled from yet another prestigious prep school, Holden embarks on a three-day journey through New York City, grappling with feelings of alienation, loneliness, and a deep sense of existential angst.",
        "totalPages": 277,
        "rating": 4.3,
        "category": "Fiction",
        "tags": [
            "Teen",
            "Classics"
        ],
        "publisher": "Little, Brown and Company",
        "yearOfPublishing": 1951
    },
    {
        "bookId": 6,
        "bookName": "To Kill a Mockingbird",
        "author": "Harper Lee",
        "image": "to_kill_a_mockingbird.jpg",
        "review": "To Kill a Mockingbird by Harper Lee is a seminal work of American literature that tackles themes of racial injustice, moral growth, and the loss of innocence in the American South during the 1930s. The novel is narrated by Scout Finch, a young girl who recounts her experiences growing up in the fictional town of Maycomb, Alabama, alongside her brother Jem and their father Atticus, a respected lawyer.",
        "totalPages": 281,
        "rating": 4.8,
        "category": "Fiction",
        "tags": [
            "Classics",
            "Drama"
        ],
        "publisher": "J. B. Lippincott & Co.",
        "yearOfPublishing": 1960
    }
]